---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle
source: html/eb2d6eca-ee09-b69b-fb7c-c84a030cc580.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle

A stream that can be used to write IndexTriangle
 primitives into an IndexBuffer

## Syntax (C#)
```csharp
public class IndexStreamTriangle : IndexStream
```